[
  {
    "title": "Back to the Future",
    "sort-title": "back-to-the-future-01",
    "year": "1985",
    "rating": "PG",
    "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/fNOH9f1aA7XRTzl1sAOx9iF553Q.jpg"
  },
  {
    "title": "Back to the Future Part II",
    "sort-title": "back-to-the-future-02",
    "year": "1989",
    "rating": "PG",
    "overview": "Marty and Doc are at it again in this wacky sequel to the 1985 blockbuster as the time-traveling duo head to 2015 to nip some McFly family woes in the bud. But things go awry thanks to bully Biff Tannen and a pesky sports almanac. In a last-ditch attempt to set things straight, Marty finds himself bound for 1955 and face to face with his teenage parents -- again.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/hQq8xZe5uLjFzSBt4LanNP7SQjl.jpg"
  },
  {
    "title": "Batman",
    "sort-title": "batman",
    "year": "1989",
    "rating": "PG-13",
    "overview": "Batman must face his most ruthless nemesis when a deformed madman calling himself \"The Joker\" seizes control of Gotham's criminal underworld.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/cij4dd21v2Rk2YtUQbV5kW69WB2.jpg"
  },
  {
    "title": "Big",
    "sort-title": "big",
    "year": "1988",
    "rating": "PG",
    "overview": "When a young boy makes a wish at a carnival machine to be big—he wakes up the following morning to find that it has been granted and his body has grown older overnight. But he is still the same 13-year-old boy inside. Now he must learn how to cope with the unfamiliar world of grown-ups including getting a job and having his first romantic encounter with a woman.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/eWhCDJiwxvx3YXkAFRiHjimnF0j.jpg"
  },
  {
    "title": "Bill & Ted's Excellent Adventure",
    "sort-title": "bill-and-ted-01",
    "year": "1989",
    "rating": "PG",
    "overview": "Bill and Ted are high school buddies starting a band. They are also about to fail their history class—which means Ted would be sent to military school—but receive help from Rufus, a traveller from a future where their band is the foundation for a perfect society. With the use of Rufus' time machine, Bill and Ted travel to various points in history, returning with important figures to help them complete their final history presentation.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/tV25lGWGWGEqUe3U0xjQTBgilSx.jpg"
  },
  {
    "title": "Caddyshack",
    "sort-title": "caddyshack",
    "year": "1980",
    "rating": "R",
    "overview": "At an exclusive country club, an ambitious young caddy, Danny Noonan, eagerly pursues a caddy scholarship in hopes of attending college and, in turn, avoiding a job at the lumber yard. In order to succeed, he must first win the favour of the elitist Judge Smails, and then the caddy golf tournament which Smails sponsors.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/21nhVVqGsOrKvkncsB5GbRxpSZh.jpg"
  },
  {
    "title": "Christmas Vacation",
    "sort-title": "christmas-vacation",
    "year": "1989",
    "rating": "PG-13",
    "overview": "It's Christmastime, and the Griswolds are preparing for a family seasonal celebration. But things never run smoothly for Clark, his wife Ellen, and their two kids. Clark's continual bad luck is worsened by his obnoxious family guests, but he manages to keep going, knowing that his Christmas bonus is due soon.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/gL8ZDtAy8vO95aAnv1H5CR4CGMA.jpg"
  },
  {
    "title": "Ferris Bueller's Day Off",
    "sort-title": "ferris-buellers-day-off",
    "year": "1986",
    "rating": "PG-13",
    "overview": "After high school slacker Ferris Bueller successfully fakes an illness in order to skip school for the day, he goes on a series of adventures throughout Chicago with his girlfriend Sloane and best friend Cameron, all the while trying to outwit his wily school principal and fed-up sister.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/9LTQNCvoLsKXP0LtaKAaYVtRaQL.jpg"
  },
  {
    "title": "Fletch",
    "sort-title": "fletch",
    "year": "1985",
    "rating": "PG",
    "overview": "When investigative reporter Irwin \"Fletch\" Fletcher goes undercover to write a piece on the drug trade at a local beach, he's approached by wealthy businessman Alan Stanwyk, who offers him $50,000 to murder him. With sarcastic wit and a knack for disguises, Fletch sets out to uncover Stanwyk's story.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/4xEwhHqCEfYzBBrRblvwAiVEpLx.jpg"
  },
  {
    "title": "Flight of the Navigator",
    "sort-title": "flight-of-the-navigator",
    "year": "1986",
    "rating": "PG",
    "overview": "12-year-old David is accidentally knocked out in the forest near his home, but when he awakens eight years have passed. His family is overjoyed to have him back, but is just as perplexed as he is that he hasn't aged. When a NASA scientist discovers a UFO nearby, David gets the chance to unravel the mystery and recover the life he lost.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/tdRgQWMximj0tL6OWu9kRTtePmI.jpg"
  },
  {
    "title": "Ghostbusters",
    "sort-title": "ghostbusters-01",
    "year": "1984",
    "rating": "PG",
    "overview": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting \"ghostbusters\" who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/7E8nLijS9AwwUEPu2oFYOVKhdFA.jpg"
  },
  {
    "title": "The Goonies",
    "sort-title": "goonies",
    "year": "1985",
    "rating": "PG",
    "overview": "A young teenager named Mikey Walsh finds an old treasure map in his father's attic. Hoping to save their homes from demolition, Mikey and his friends Data Wang, Chunk Cohen, and Mouth Devereaux run off on a big quest to find the secret stash of Pirate One-Eyed Willie.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/eBU7gCjTCj9n2LTxvCSIXXOvHkD.jpg"
  },
  {
    "title": "The Karate Kid",
    "sort-title": "karate-kid-01",
    "year": "1984",
    "rating": "PG",
    "overview": "Daniel, a fatherless teenager, arrives in Los Angeles and becomes the object of bullying by a gang of karate students when he strikes up a relationship with Ali, the gang leader’s ex-girlfriend, so Daniel asks Miyagi, a master of martial arts, to help him learn karate.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/1mp4ViklKvA0WXXsNvNx0RBuiit.jpg"
  },
  {
    "title": "The Money Pit",
    "sort-title": "money-pit",
    "year": "1986",
    "rating": "PG",
    "overview": "After being evicted from their Manhattan apartment, a couple buy what looks like the home of their dreams—only to find themselves saddled with a bank-account-draining nightmare. Struggling to keep their relationship together as their rambling mansion falls to pieces around them, the two watch in hilarious horror as everything—including the kitchen sink—disappears into the Money Pit.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/bohhidIi1WWU5NNYF9l5wLQu3Ii.jpg"
  },
  {
    "title": "Mr. Mom",
    "sort-title": "mr-mom",
    "year": "1983",
    "rating": "PG",
    "overview": "Jack and Caroline are a couple making a decent living when Jack suddenly loses his job. They agree that he should stay at home and look after the house while Caroline works. It's just that he's never done it before, and really doesn't have a clue...",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/x5X1X20BsyQgMHymQtLkfCfqMSU.jpg"
  },
  {
    "title": "PeeWee's Big Adventure",
    "sort-title": "peewees-big-adventure",
    "year": "1985",
    "rating": "PG",
    "overview": "The eccentric and childish Pee-wee Herman embarks on a big adventure when his beloved bicycle is stolen. Armed with information from a fortune-teller and a relentless obsession with his prized possession, Pee-wee encounters a host of odd characters and bizarre situations as he treks across the country to recover his bike.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/2PT1qTPkD3UvP9zZ2EqZkDNyJl1.jpg"
  },
  {
    "title": "Raiders of the Lost Ark",
    "sort-title": "raiders-of-the-lost-ark",
    "year": "1981",
    "rating": "PG",
    "overview": "When Dr. Indiana Jones - the tweed-suited professor who just happens to be a celebrated archaeologist - is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/ceG9VzoRAVGwivFU403Wc3AHRys.jpg"
  },
  {
    "title": "Return of the Jedi",
    "sort-title": "return-of-the-jedi",
    "year": "1983",
    "rating": "PG",
    "overview": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/xxCnFmRZ83jHTZsBiceG4IBUGoq.jpg"
  },
  {
    "title": "Romancing the Stone",
    "sort-title": "romancing-the-stone",
    "year": "1984",
    "rating": "PG",
    "overview": "Though she can spin wild tales of passionate romance, novelist Joan Wilder has no life of her own. Then one day adventure comes her way in the form of a mysterious package. It turns out that the parcel is the ransom she'll need to free her abducted sister, so Joan flies to South America to hand it over. But she gets on the wrong bus and winds up hopelessly stranded in the jungle.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/qfIlVOYZH5RiZ0ndFKUpr5Zn2Bx.jpg"
  },
  {
    "title": "Splash",
    "sort-title": "splash",
    "year": "1984",
    "rating": "PG",
    "overview": "A successful businessman falls in love with the girl of his dreams. There's one big complication though; he's fallen hook, line and sinker for a mermaid.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/7FutTsMWBwVhjk1Ujf1wtndUVZh.jpg"
  },
  {
    "title": "Teen Wolf",
    "sort-title": "teen-wolf-01",
    "year": "1985",
    "rating": "PG",
    "overview": "When a shy teenager's new-found powers help him score at basketball - and with the popular girls - he has some pretty hairy decisions to make.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/bv9rY9eoue2Hat6tcvrKVQ0ow8v.jpg"
  },
  {
    "title": "The Terminator",
    "sort-title": "terminator-01",
    "year": "1984",
    "rating": "R",
    "overview": "In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/qvktm0BHcnmDpul4Hz01GIazWPr.jpg"
  },
  {
    "title": "Tron",
    "sort-title": "tron-01",
    "year": "1982",
    "rating": "PG",
    "overview": "When brilliant video game maker Flynn hacks the mainframe of his ex-employer, he is beamed inside an astonishing digital world...and becomes part of the very game he is designing. In his mission through cyberspace, Flynn matches wits with a maniacal Master Control Program and teams up with Tron, a security measure created to bring balance to the digital environment.",
    "image": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/zwSFEczP7AzqugAHHIX3zHniT0t.jpg"
  }
]
